fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РассчитатьИУстановитьКоличествоДнейНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РассчитатьИУстановитьКоличествоДнейНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников
&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)
	ПодсчетКоличестваДней(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)
	ПодсчетКоличестваДней(Элемент);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", Новый Структура("ПутьКДанным", ПоместитьДанныеВоВременноеХранилище()));
КонецПроцедуры
#КонецОбласти   

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
КонецФункции 

&НаКлиенте
Процедура ПодсчетКоличестваДней (Элемент)
	СтрокаТабличнойЧасти = Элементы.ОтпускаСотрудников.ТекущиеДанные;
   	СтрокаТабличнойЧасти.КоличествоДней = (НачалоДня(СтрокаТабличнойЧасти.ДатаОкончания) - НачалоДня(СтрокаТабличнойЧасти.ДатаНачала))/60/60/24 +1;
КонецПроцедуры

&НаСервере
Процедура РассчитатьИУстановитьКоличествоДней (СтрокаТЧ)
	
  Если СтрокаТЧ.ДатаНачала <> Дата(1, 1, 1) 
        И СтрокаТЧ.ДатаОкончания <> Дата(1, 1, 1) Тогда
        
        // Расчет количества дней (включая оба конца)
        СтрокаТЧ.КоличествоДней = (НачалоДня(СтрокаТЧ.ДатаОкончания) - НачалоДня(СтрокаТЧ.ДатаНачала)) / 60 / 60 / 24 + 1;
        
    Иначе
        СтрокаТЧ.КоличествоДней = 0;
        
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РассчитатьИУстановитьКоличествоДнейНаСервере()
	Для каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
		РассчитатьИУстановитьКоличествоДней(СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
